# YOLO11 + EMA_orig + C2PSA + LVC codebook attention → standard FPN+PAN neck
# LVC (Learnable Visual Center) as channel-preserving plugin after C2PSA
# LVC: K=48 codebook entries
# Based on CRT-YOLO paper (2505.10825)

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (c2psa_ema_orig + LVC after C2PSA)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]              # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]              # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]       # 4 → f3
  - [-1, 1, Conv, [512, 3, 2]]              # 5-P4/16
  - [-1, 2, C3k2, [512, True]]              # 6
  - [-1, 1, EMA_orig, [512]]                # 7  EMA after P4
  - [-1, 1, Conv, [1024, 3, 2]]             # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]             # 9
  - [-1, 1, EMA_orig, [1024]]               # 10 EMA after P5
  - [-1, 1, SPPF, [1024, 5]]                # 11
  - [-1, 2, C2PSA, [1024]]                  # 12
  - [-1, 1, LVC, [1024, 48]]                # 13  LVC codebook attention

# Head: standard FPN+PAN neck (indices shifted +1 due to LVC)
head:
  # FPN top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 7], 1, Concat, [1]]               # 15  cat P4 (EMA)
  - [-1, 2, C3k2, [512, False]]             # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 4], 1, Concat, [1]]               # 18  cat P3
  - [-1, 2, C3k2, [256, False]]             # 19  (P3/8-small)

  # PAN bottom-up
  - [-1, 1, Conv, [256, 3, 2]]              # 20
  - [[-1, 16], 1, Concat, [1]]              # 21  cat head P4
  - [-1, 2, C3k2, [512, False]]             # 22  (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]              # 23
  - [[-1, 13], 1, Concat, [1]]              # 24  cat LVC output
  - [-1, 2, C3k2, [1024, True]]             # 25  (P5/32-large)

  - [[19, 22, 25], 1, Detect, [nc]]         # 26  Detect(P3, P4, P5)
