# YOLO11 + EMA_orig after P4/P5 + C2PSA + CFP neck (EVC + GCR)
# Based on CRT-YOLO paper (2505.10825)

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (same as yolo11-c2psa_ema_orig.yaml)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]              # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]              # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]       # 4 → f3
  - [-1, 1, Conv, [512, 3, 2]]              # 5-P4/16
  - [-1, 2, C3k2, [512, True]]              # 6 → f4
  - [-1, 1, EMA_orig, [512]]                # 7  EMA after P4
  - [-1, 1, Conv, [1024, 3, 2]]             # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]             # 9 → f5
  - [-1, 1, EMA_orig, [1024]]               # 10 EMA after P5
  - [-1, 1, SPPF, [1024, 5]]                # 11
  - [-1, 2, C2PSA, [1024]]                  # 12

# Head: CFP neck (EVC + GCR) → Detect
# c_evc=256 (paper original), GCR Conv=512 (=2*c_evc), all width-scaled
head:
  - [-1, 1, EVC, [256, 64, 0.1]]            # 13 → EVC out (2*c_evc ch)

  # GCR: regulate P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 7], 1, Concat, [1]]               # 15 concat with f4 (after EMA)
  - [-1, 1, Conv, [512, 1, 1]]              # 16 → regulated P4

  # GCR: regulate P3
  - [13, 1, nn.Upsample, [None, 4, "nearest"]]  # 17 upsample EVC 4x
  - [[-1, 4], 1, Concat, [1]]               # 18 concat with f3
  - [-1, 1, Conv, [512, 1, 1]]              # 19 → regulated P3

  - [[19, 16, 13], 1, Detect, [nc]]         # 20 Detect(P3, P4, P5)
